# Question 1
`docker run --help `
![](https://i.imgur.com/rjaEcNI.png)

# Question 2
- `docker run -it --entrypoint bash python:3.9`
- `pip list`

![](https://i.imgur.com/M6hT0rt.png)

# Question 3

In [4]:
import pandas as pd
from sqlalchemy import create_engine

# Load the datasets into DataFrames
df_trips = pd.read_csv('green_tripdata_2019-09.csv')
df_zones = pd.read_csv('taxi+_zone_lookup.csv')

# Create an SQLAlchemy engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/postgres')

# Load DataFrames into PostgreSQL database
df_trips.to_sql('green_taxi_trips', engine, if_exists='replace', index=False)
df_zones.to_sql('taxi_zone_lookup', engine, if_exists='replace', index=False)

C:\Users\adrian.muhammad\AppData\Local\Temp\ipykernel_11444\70249376.py:5: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df_trips = pd.read_csv('green_tripdata_2019-09.csv')

265

In [5]:
query = """
SELECT COUNT(*)
FROM green_taxi_trips
WHERE DATE(lpep_pickup_datetime) = '2019-09-18'
AND DATE(lpep_dropoff_datetime) = '2019-09-18';
"""

result = pd.read_sql_query(query, engine)
result

   count
0  15612

# Question 4

In [6]:
query = """
SELECT DATE(lpep_pickup_datetime) as pickup_day, SUM(trip_distance) as total_distance
FROM green_taxi_trips
WHERE DATE(lpep_pickup_datetime) IN ('2019-09-18', '2019-09-16', '2019-09-26', '2019-09-21')
GROUP BY DATE(lpep_pickup_datetime)
ORDER BY total_distance DESC
LIMIT 1;
"""

result = pd.read_sql_query(query, engine)
result

   pickup_day  total_distance
0  2019-09-26        58759.94

# Question 5

In [18]:
query = """
SELECT z."Borough", SUM(t.total_amount) as total_revenue
FROM green_taxi_trips t
JOIN taxi_zone_lookup z ON t."PULocationID" = z."LocationID"
WHERE DATE(t."lpep_pickup_datetime") = '2019-09-18'
AND z."Borough" != 'Unknown'
GROUP BY z."Borough"
HAVING SUM(t.total_amount) > 50000
ORDER BY total_revenue DESC
LIMIT 3;
"""

result = pd.read_sql_query(query, engine)
result

     Borough  total_revenue
0   Brooklyn       96333.24
1  Manhattan       92271.30
2     Queens       78671.71

# Question 6

In [20]:
query = """
SELECT z2."Zone" as dropoff_zone, MAX(t.tip_amount) as largest_tip
FROM green_taxi_trips t
JOIN taxi_zone_lookup z1 ON t."PULocationID" = z1."LocationID"
JOIN taxi_zone_lookup z2 ON t."DOLocationID" = z2."LocationID"
WHERE z1."Zone" = 'Astoria'
AND DATE(t."lpep_pickup_datetime") >= '2019-09-01' 
AND DATE(t."lpep_pickup_datetime") < '2019-10-01'
GROUP BY z2."Zone"
ORDER BY largest_tip DESC
LIMIT 1;
"""

result = pd.read_sql_query(query, engine)
result

  dropoff_zone  largest_tip
0  JFK Airport        62.31

# Question 7